GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ccfg.h
/******************************************************************************
*  Filename:       hw_ccfg.h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CCFG_H__
#define __HW_CCFG_H__


//*****************************************************************************
//
// This section defines the register offsets of
// CCFG component
//
//*****************************************************************************
// Mode Configuration 1
#define CCFG_O_MODE_CONF_1                                          0x00000FAC

// CCFG Size and Disable Flags
#define CCFG_O_SIZE_AND_DIS_FLAGS                                   0x00000FB0

// Mode Configuration 0
#define CCFG_O_MODE_CONF                                            0x00000FB4

// Voltage Load 0
#define CCFG_O_VOLT_LOAD_0                                          0x00000FB8

// Voltage Load 1
#define CCFG_O_VOLT_LOAD_1                                          0x00000FBC

// Real Time Clock Offset
#define CCFG_O_RTC_OFFSET                                           0x00000FC0

// Frequency Offset
#define CCFG_O_FREQ_OFFSET                                          0x00000FC4

// IEEE MAC Address 0
#define CCFG_O_IEEE_MAC_0                                           0x00000FC8

// IEEE MAC Address 1
#define CCFG_O_IEEE_MAC_1                                           0x00000FCC

// IEEE BLE Address 0
#define CCFG_O_IEEE_BLE_0                                           0x00000FD0

// IEEE BLE Address 1
#define CCFG_O_IEEE_BLE_1                                           0x00000FD4

// Bootloader Config
#define CCFG_O_BL_CONFIG                                            0x00000FD8

// Erase Configuration
#define CCFG_O_ERASE_CONF                                           0x00000FDC

// TI Options
#define CCFG_O_CCFG_TI_OPTIONS                                      0x00000FE0

// Test Access Points Enable 0
#define CCFG_O_CCFG_TAP_DAP_0                                       0x00000FE4

// Test Access Points Enable 1
#define CCFG_O_CCFG_TAP_DAP_1                                       0x00000FE8

// Image Valid
#define CCFG_O_IMAGE_VALID_CONF                                     0x00000FEC

// Protect Sectors 0-31
#define CCFG_O_CCFG_PROT_31_0                                       0x00000FF0

// Protect Sectors 32-63
#define CCFG_O_CCFG_PROT_63_32                                      0x00000FF4

// Protect Sectors 64-95
#define CCFG_O_CCFG_PROT_95_64                                      0x00000FF8

// Protect Sectors 96-127
#define CCFG_O_CCFG_PROT_127_96                                     0x00000FFC

//*****************************************************************************
//
// Register: CCFG_O_MODE_CONF_1
//
//*****************************************************************************
// Field: [23:20] ALT_DCDC_VMIN
//
// Minimum voltage to use DC/DC is (28 + ALT_DCDC_VMIN)/16.
// 0: 1.75V
// 1: 1.8125V
//  .
//  .
// 14: 2.625V
// 15: 2.6875V
#define CCFG_MODE_CONF_1_ALT_DCDC_VMIN_M                            0x00F00000
#define CCFG_MODE_CONF_1_ALT_DCDC_VMIN_S                            20

// Field: [19]    ALT_DCDC_DITHER_EN
//
// Enable DC/DC dithering
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN                         0x00080000
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN_BITN                    19
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN_M                       0x00080000
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN_S                       19

// Field: [18:16] ALT_DCDC_IPEAK
//
// Inductor peak current.
// 0: Min 31mA
// 4: Typical 47mA
// 7: Max 59mA
#define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_M                           0x00070000
#define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_S                           16

// Field: [15:12] DELTA_IBIAS_INIT
//
// Signed delta value for IBIAS_INIT
#define CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_M                         0x0000F000
#define CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_S                         12

// Field: [11:8] DELTA_IBIAS_OFFSET
//
// Signed delta value for IBIAS_OFFSET
#define CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_M                       0x00000F00
#define CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_S                       8

