GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ccfg.h
// Field: [7:0] XOSC_MAX_START
//
// Unsigned value of maximum XOSC startup time in units of 100us
#define CCFG_MODE_CONF_1_XOSC_MAX_START_M                           0x000000FF
#define CCFG_MODE_CONF_1_XOSC_MAX_START_S                           0

//*****************************************************************************
//
// Register: CCFG_O_SIZE_AND_DIS_FLAGS
//
//*****************************************************************************
// Field: [31:16] SIZE_OF_CCFG
//
// Total size of CCFG
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_M                      0xFFFF0000
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_S                      16

// Field: [15:2] DISABLE_FLAGS
//
// Reserved for functionality disable flags.
// Currently unused.
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_M                     0x0000FFFC
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_S                     2

// Field: [1]    DIS_ALT_DCDC_SETTING
//
// Disable flag for alternative DCDC setting
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING                0x00000002
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING_BITN           1
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING_M              0x00000002
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING_S              1

// Field: [0]    DIS_XOSC_OVR
//
// Disable flag for XOSC override functionality.
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR                        0x00000001
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_BITN                   0
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_M                      0x00000001
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_S                      0

//*****************************************************************************
//
// Register: CCFG_O_MODE_CONF
//
//*****************************************************************************
// Field: [27]    DCDC_RECHARGE
//
// 0: Use the DC/DC during recharge in powerdown
// 1:Do not use the DC/DC during recharge in powerdown (default)
#define CCFG_MODE_CONF_DCDC_RECHARGE                                0x08000000
#define CCFG_MODE_CONF_DCDC_RECHARGE_BITN                           27
#define CCFG_MODE_CONF_DCDC_RECHARGE_M                              0x08000000
#define CCFG_MODE_CONF_DCDC_RECHARGE_S                              27

// Field: [26]    DCDC_ACTIVE
//
// 0: Use the DC/DC during active mode
// 1: Do not use the DC/DC during active mode (default)
#define CCFG_MODE_CONF_DCDC_ACTIVE                                  0x04000000
#define CCFG_MODE_CONF_DCDC_ACTIVE_BITN                             26
#define CCFG_MODE_CONF_DCDC_ACTIVE_M                                0x04000000
#define CCFG_MODE_CONF_DCDC_ACTIVE_S                                26

// Field: [25]    VDDR_EXT_LOAD
//
// 0: VDDR may be loaded externally (may not be supported)
// 1: VDDR is not loaded externally (default)
#define CCFG_MODE_CONF_VDDR_EXT_LOAD                                0x02000000
#define CCFG_MODE_CONF_VDDR_EXT_LOAD_BITN                           25
#define CCFG_MODE_CONF_VDDR_EXT_LOAD_M                              0x02000000
#define CCFG_MODE_CONF_VDDR_EXT_LOAD_S                              25

// Field: [24]    VDDS_BOD_LEVEL
//
// 1: VDDS BOD level is 1.8V (or 1.65V for external regulator mode) (default).
// 0: VDDS BOD level is 2.0V (necessary for 125 degrees C or for external load
// mode, or for maximum PA output power on CC13xx).
//
// Note that production devices meant for 125 degrees C operation will have a
// VDDS_BOD level of 2.0V trimmed in e-fuse, which means that this field will have
// no function on these devices.
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL                               0x01000000
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL_BITN                          24
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL_M                             0x01000000
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL_S                             24

// Field: [23:22] SCLK_LF_OPTION
//
// 0: Low frequency clock derived from High Frequency XOSC
// 1: TBD: Digital input from AON (selects XOSC_LF as source and
// XOSC_LF_DIG_BYPASS=1)
// 2: Low frequency XOSC
// 3: Low frequency RCOSC (default)
#define CCFG_MODE_CONF_SCLK_LF_OPTION_M                             0x00C00000
#define CCFG_MODE_CONF_SCLK_LF_OPTION_S                             22

// Field: [20]    RTC_COMP
//
// 0: Apply RTC temperature compensation (may not be supported)
// 1: Don't apply temperature compensation to the RTC (default)
#define CCFG_MODE_CONF_RTC_COMP                                     0x00100000
#define CCFG_MODE_CONF_RTC_COMP_BITN                                20
#define CCFG_MODE_CONF_RTC_COMP_M                                   0x00100000
#define CCFG_MODE_CONF_RTC_COMP_S                                   20

// Field: [19:18] XOSC_FREQ
//
// 00: MEMS, reserved
// 01: BAW, reserved
// 10: 48MHz (may not be supported)
// 11: 24MHz (default)
#define CCFG_MODE_CONF_XOSC_FREQ_M                                  0x000C0000
#define CCFG_MODE_CONF_XOSC_FREQ_S                                  18

// Field: [17]    XOSC_CAP_MOD
//
// 0: Apply cap-array delta (may not be supported)
// 1: Don't apply cap-array delta (default)
//
#define CCFG_MODE_CONF_XOSC_CAP_MOD                                 0x00020000
#define CCFG_MODE_CONF_XOSC_CAP_MOD_BITN                            17
#define CCFG_MODE_CONF_XOSC_CAP_MOD_M                               0x00020000
#define CCFG_MODE_CONF_XOSC_CAP_MOD_S                               17

// Field: [16]    HF_COMP
//
// 0: Apply 48MHz compensation (may not be supported)
// 1: Don't apply 48MHz frequency compensation (default)
#define CCFG_MODE_CONF_HF_COMP                                      0x00010000
#define CCFG_MODE_CONF_HF_COMP_BITN                                 16
#define CCFG_MODE_CONF_HF_COMP_M                                    0x00010000
#define CCFG_MODE_CONF_HF_COMP_S                                    16

