GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ccfg.h
// Field: [15:8] PBIST1_TAP_ENABLE
//
// 0xC5: AON_WUC:JTAGCFG.PBIST1_TAP will be set to 1 if
// FCFG1:FCFG1_TAP_DAP_1.PBIST1_TAP_ENABLE also have a value of 0xC5. Bit field is
// written by boot FW while in safezone.
//
// Any other value: AON_WUC:JTAGCFG.PBIST1_TAP will be set to 0 by boot FW
// while in safezone.
//
// NOTE! This parameter must be written to the value of 0xC5 by production test.
#define CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE_M                     0x0000FF00
#define CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE_S                     8

// Field: [7:0] WUC_TAP_ENABLE
//
// 0xC5: AON_WUC:JTAGCFG.WUC_TAP will be set to 1 if
// FCFG1:FCFG1_TAP_DAP_1.WUC_TAP_ENABLE also have a value of 0xC5. Bit field is
// written by boot FW while in safezone.
//
// Any other value: AON_WUC:JTAGCFG.WUC_TAP will be set to 0 by boot FW while
// in safezone.
//
// NOTE! This parameter must be written to the value of 0xC5 by production test.
#define CCFG_CCFG_TAP_DAP_1_WUC_TAP_ENABLE_M                        0x000000FF
#define CCFG_CCFG_TAP_DAP_1_WUC_TAP_ENABLE_S                        0

//*****************************************************************************
//
// Register: CCFG_O_IMAGE_VALID_CONF
//
//*****************************************************************************
// Field: [31:0] IMAGE_VALID
//
// IMAGE_VALID:
// This field must have a value of 0x00000000 in order for enabling the boot
// sequence to transfer control to a flash image.
//
#define CCFG_IMAGE_VALID_CONF_IMAGE_VALID_M                         0xFFFFFFFF
#define CCFG_IMAGE_VALID_CONF_IMAGE_VALID_S                         0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_PROT_31_0
//
//*****************************************************************************
// Field: [31]    WRT_PROT_SEC_31
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_31                         0x80000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_31_BITN                    31
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_31_M                       0x80000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_31_S                       31

// Field: [30]    WRT_PROT_SEC_30
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_30                         0x40000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_30_BITN                    30
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_30_M                       0x40000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_30_S                       30

// Field: [29]    WRT_PROT_SEC_29
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_29                         0x20000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_29_BITN                    29
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_29_M                       0x20000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_29_S                       29

// Field: [28]    WRT_PROT_SEC_28
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_28                         0x10000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_28_BITN                    28
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_28_M                       0x10000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_28_S                       28

// Field: [27]    WRT_PROT_SEC_27
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_27                         0x08000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_27_BITN                    27
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_27_M                       0x08000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_27_S                       27

// Field: [26]    WRT_PROT_SEC_26
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_26                         0x04000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_26_BITN                    26
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_26_M                       0x04000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_26_S                       26

// Field: [25]    WRT_PROT_SEC_25
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_25                         0x02000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_25_BITN                    25
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_25_M                       0x02000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_25_S                       25

// Field: [24]    WRT_PROT_SEC_24
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_24                         0x01000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_24_BITN                    24
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_24_M                       0x01000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_24_S                       24

// Field: [23]    WRT_PROT_SEC_23
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_23                         0x00800000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_23_BITN                    23
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_23_M                       0x00800000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_23_S                       23

// Field: [22]    WRT_PROT_SEC_22
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_22                         0x00400000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_22_BITN                    22
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_22_M                       0x00400000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_22_S                       22

// Field: [21]    WRT_PROT_SEC_21
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_21                         0x00200000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_21_BITN                    21
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_21_M                       0x00200000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_21_S                       21

// Field: [20]    WRT_PROT_SEC_20
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_20                         0x00100000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_20_BITN                    20
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_20_M                       0x00100000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_20_S                       20

// Field: [19]    WRT_PROT_SEC_19
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_19                         0x00080000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_19_BITN                    19
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_19_M                       0x00080000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_19_S                       19

// Field: [18]    WRT_PROT_SEC_18
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_18                         0x00040000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_18_BITN                    18
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_18_M                       0x00040000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_18_S                       18

// Field: [17]    WRT_PROT_SEC_17
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_17                         0x00020000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_17_BITN                    17
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_17_M                       0x00020000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_17_S                       17

// Field: [16]    WRT_PROT_SEC_16
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_16                         0x00010000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_16_BITN                    16
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_16_M                       0x00010000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_16_S                       16

// Field: [15]    WRT_PROT_SEC_15
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_15                         0x00008000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_15_BITN                    15
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_15_M                       0x00008000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_15_S                       15

// Field: [14]    WRT_PROT_SEC_14
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_14                         0x00004000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_14_BITN                    14
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_14_M                       0x00004000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_14_S                       14

