GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ccfg.h
// Field: [13]    WRT_PROT_SEC_13
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_13                         0x00002000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_13_BITN                    13
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_13_M                       0x00002000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_13_S                       13

// Field: [12]    WRT_PROT_SEC_12
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_12                         0x00001000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_12_BITN                    12
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_12_M                       0x00001000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_12_S                       12

// Field: [11]    WRT_PROT_SEC_11
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_11                         0x00000800
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_11_BITN                    11
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_11_M                       0x00000800
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_11_S                       11

// Field: [10]    WRT_PROT_SEC_10
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_10                         0x00000400
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_10_BITN                    10
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_10_M                       0x00000400
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_10_S                       10

// Field: [9]    WRT_PROT_SEC_9
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_9                          0x00000200
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_9_BITN                     9
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_9_M                        0x00000200
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_9_S                        9

// Field: [8]    WRT_PROT_SEC_8
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_8                          0x00000100
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_8_BITN                     8
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_8_M                        0x00000100
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_8_S                        8

// Field: [7]    WRT_PROT_SEC_7
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_7                          0x00000080
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_7_BITN                     7
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_7_M                        0x00000080
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_7_S                        7

// Field: [6]    WRT_PROT_SEC_6
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_6                          0x00000040
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_6_BITN                     6
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_6_M                        0x00000040
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_6_S                        6

// Field: [5]    WRT_PROT_SEC_5
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_5                          0x00000020
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_5_BITN                     5
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_5_M                        0x00000020
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_5_S                        5

// Field: [4]    WRT_PROT_SEC_4
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_4                          0x00000010
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_4_BITN                     4
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_4_M                        0x00000010
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_4_S                        4

// Field: [3]    WRT_PROT_SEC_3
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_3                          0x00000008
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_3_BITN                     3
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_3_M                        0x00000008
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_3_S                        3

// Field: [2]    WRT_PROT_SEC_2
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_2                          0x00000004
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_2_BITN                     2
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_2_M                        0x00000004
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_2_S                        2

// Field: [1]    WRT_PROT_SEC_1
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_1                          0x00000002
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_1_BITN                     1
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_1_M                        0x00000002
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_1_S                        1

// Field: [0]    WRT_PROT_SEC_0
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_0                          0x00000001
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_0_BITN                     0
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_0_M                        0x00000001
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_0_S                        0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_PROT_63_32
//
//*****************************************************************************
// Field: [31]    WRT_PROT_SEC_63
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_63                        0x80000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_63_BITN                   31
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_63_M                      0x80000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_63_S                      31

// Field: [30]    WRT_PROT_SEC_62
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_62                        0x40000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_62_BITN                   30
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_62_M                      0x40000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_62_S                      30

