GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_ccfg.h
// Field: [6]    WRT_PROT_SEC_70
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_70                        0x00000040
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_70_BITN                   6
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_70_M                      0x00000040
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_70_S                      6

// Field: [5]    WRT_PROT_SEC_69
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_69                        0x00000020
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_69_BITN                   5
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_69_M                      0x00000020
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_69_S                      5

// Field: [4]    WRT_PROT_SEC_68
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_68                        0x00000010
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_68_BITN                   4
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_68_M                      0x00000010
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_68_S                      4

// Field: [3]    WRT_PROT_SEC_67
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_67                        0x00000008
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_67_BITN                   3
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_67_M                      0x00000008
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_67_S                      3

// Field: [2]    WRT_PROT_SEC_66
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_66                        0x00000004
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_66_BITN                   2
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_66_M                      0x00000004
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_66_S                      2

// Field: [1]    WRT_PROT_SEC_65
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_65                        0x00000002
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_65_BITN                   1
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_65_M                      0x00000002
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_65_S                      1

// Field: [0]    WRT_PROT_SEC_64
//
// 0: Sector protected
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_64                        0x00000001
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_64_BITN                   0
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_64_M                      0x00000001
#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_64_S                      0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_PROT_127_96
//
//*****************************************************************************
// Field: [31]    WRT_PROT_SEC_127
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_127                      0x80000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_127_BITN                 31
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_127_M                    0x80000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_127_S                    31

// Field: [30]    WRT_PROT_SEC_126
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_126                      0x40000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_126_BITN                 30
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_126_M                    0x40000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_126_S                    30

// Field: [29]    WRT_PROT_SEC_125
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_125                      0x20000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_125_BITN                 29
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_125_M                    0x20000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_125_S                    29

// Field: [28]    WRT_PROT_SEC_124
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_124                      0x10000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_124_BITN                 28
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_124_M                    0x10000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_124_S                    28

// Field: [27]    WRT_PROT_SEC_123
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_123                      0x08000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_123_BITN                 27
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_123_M                    0x08000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_123_S                    27

// Field: [26]    WRT_PROT_SEC_122
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_122                      0x04000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_122_BITN                 26
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_122_M                    0x04000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_122_S                    26

// Field: [25]    WRT_PROT_SEC_121
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_121                      0x02000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_121_BITN                 25
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_121_M                    0x02000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_121_S                    25

// Field: [24]    WRT_PROT_SEC_120
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_120                      0x01000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_120_BITN                 24
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_120_M                    0x01000000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_120_S                    24

// Field: [23]    WRT_PROT_SEC_119
//
// 0: Sector protected
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_119                      0x00800000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_119_BITN                 23
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_119_M                    0x00800000
#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_119_S                    23

